const data = [
    {
        mainkey :'DIKW피라미드',
        cat:['데이터','데이터개념','DIKW'],
    },
    {
        mainkey :'Data',
        sub: '순수한 사실자체',
        eg: 'A마트100원 B마트 200원',
        cat:['데이터','데이터개념','DIKW','Data'],
    },
    {
        mainkey :'Information',
        sub: 'Data를 가공,계산후 의미붙임',
        eg : 'A마트가 B마트보다 쌈',
        cat:['데이터','데이터개념','DIKW','Information'],
    },
    {
        mainkey :'Knowledge',
        sub: '정보사이의 규칙,패턴을읽어 일반화',
        eg : 'A마트가 저렴하니 A마트에서 구매해야겠다.',
        cat:['데이터','데이터개념','DIKW','Knowledge'],
    },
    {
        mainkey :'Wisdom',
        sub: '근본 원리를 이해한뒤 나오는판단',
        eg : 'A마트가 다른 물건도 쌀 것이다',
        cat:['데이터','데이터개념','DIKW','Wisdom'],
    },
    {
        mainkey :'데이터표현단위',
        cat:['데이터','데이터표현'],
    },
    {
        mainkey :'Bit',
        sub:'0,1만 표현할 수 있는 최소한의단위',
        cat:['데이터','데이터표현','데이터표현단위'],
    },
    {
        mainkey :'Byte',
        sub:'비트 8개를 한줄로 묶은것',
        cat:['데이터','데이터표현','데이터표현단위'],
    },
    {
        mainkey :'KB',
        sub:'1024바이트',
        cat:['데이터','데이터표현','데이터표현단위'],
    },
    {
        mainkey :'MB',
        sub:'1024KB',
        cat:['데이터','데이터표현','데이터표현단위'],
    },
    {
        mainkey :'GB',
        sub:'1024MB',
        cat:['데이터','데이터표현','데이터표현단위'],
    },
    {
        mainkey :'TB',
        sub:'1024GB',
        cat:['데이터','데이터표현','데이터표현단위'],
    },
    {
        mainkey :'PB',
        sub:'1024TB',
        cat:['데이터','데이터표현','데이터표현단위'],
    },
    {
        mainkey :'EB',
        sub:'1024PB',
        cat:['데이터','데이터표현','데이터표현단위'],
    },
    {
        mainkey :'암묵지',
        sub:'몸에 배어있지만 겉으로 드러나지않은 무형의지식',
        cat:['데이터','데이터개념','지식','형태'],
    },
    {
        mainkey :'형식지',
        sub:'언어,문자,기호로 표현되어 겉으로 드러난 유형의지식',
        cat:['데이터','데이터개념','지식','형태'],
    },
    {
        mainkey :'공통화',
        sub:'암묵->암묵',
        eg:'어깨너머로배우기',
        cat:['데이터','데이터개념','지식','변환방법','SECI'],
    },
    {
        mainkey :'표출화',
        sub:'암묵->형식',
        eg:'내 노하우 글로쓰기',
        cat:['데이터','데이터개념','지식','변환방법','SECI'],
    },
    {
        mainkey :'연결화',
        sub:'형식->형식',
        eg:'여러문서를 엮어서 새 자료 만들기',
        cat:['데이터','데이터개념','지식','변환방법','SECI'],
    },
    {
        mainkey :'내면화',
        sub:'형식->암묵',
        eg:'매뉴얼을 익혀 몸에 배게하기',
        cat:['데이터','데이터개념','지식','변환방법','SECI'],
    },
    {
        mainkey :'나선구조',
        sub:'SECI 4단계 반복',
        eg:'개인의 지식에서 조직전체의 자산으로 축적',
        cat:['데이터','데이터개념','지식','변환방법'],
    },
    {
        mainkey :'데이터베이스',
        cat:['데이터','데이터베이스'],
    },
    {
        mainkey :'일반',
        cat:['데이터','데이터베이스','특성'],
    },
    {
        mainkey :'실시간 접근성',
        sub:'이용자 질의에 즉시처리응답',
        cat:['데이터','데이터베이스','특성','일반'],
    },
    {
        mainkey :'계속적 변화',
        sub:'삽입,삭제,갱신을 통해 내용이 계속바뀜',
        cat:['데이터','데이터베이스','특성','일반'],
    },
    {
        mainkey :'동시 공용',
        sub:'사용자가 서로 다른목적으로 같은데이터 동시이용',
        cat:['데이터','데이터베이스','특성','일반'],
    },
    {
        mainkey :'내용에 의한 참조',
        sub:'데이터의 내용(값)에 의한 참조',
        cat:['데이터','데이터베이스','특성','일반'],
    },

]