let data = [
    {
        mainkey :'데이터개념',
        cat:['데이터'],
    },
    {
        mainkey :'DIKW(데이터피라미드)',
        cat:['데이터','데이터개념'],
    },
    {
        mainkey :'Data',
        sub: '순수한 사실자체',
        eg: 'A마트100원 B마트 200원',
        cat:['데이터','데이터개념','DIKW(데이터피라미드)'],
    },
    {
        mainkey :'Information',
        sub: 'Data를 가공,계산후 의미붙임',
        eg : 'A마트가 B마트보다 쌈',
        cat:['데이터','데이터개념','DIKW(데이터피라미드)'],
    },
    {
        mainkey :'Knowledge',
        sub: '정보사이의 규칙,패턴을읽어 일반화',
        eg : 'A마트가 저렴하니 A마트에서 구매해야겠다.',
        cat:['데이터','데이터개념','DIKW(데이터피라미드)'],
    },
    {
        mainkey :'Wisdom',
        sub: '근본 원리를 이해한뒤 나오는판단',
        eg : 'A마트가 다른 물건도 쌀 것이다',
        cat:['데이터','데이터개념','DIKW(데이터피라미드)','Wisdom'],
    },
    {
        mainkey :'데이터표현',
        cat:['데이터'],
    },
    {
        mainkey :'데이터표현단위',
        sub:'KB부터는 직전 단위의 1024배(=1024ⁿ Byte)씩 증가',
        cat:['데이터','데이터표현'],
    },
    {
        mainkey :'Bit',
        sub:'0,1만 표현할 수 있는 최소한의단위',
        cat:['데이터','데이터표현','데이터표현단위'],
    },
    {
        mainkey :'Byte',
        sub:'비트 8개를 한줄로 묶은것',
        cat:['데이터','데이터표현','데이터표현단위'],
    },
    {
        mainkey :'KB',
        sub:'1024바이트',
        cat:['데이터','데이터표현','데이터표현단위'],
    },
    {
        mainkey :'MB',
        cat:['데이터','데이터표현','데이터표현단위'],
    },
    {
        mainkey :'GB',
        cat:['데이터','데이터표현','데이터표현단위'],
    },
    {
        mainkey :'TB',
        cat:['데이터','데이터표현','데이터표현단위'],
    },
    {
        mainkey :'PB',
        sub:'흔히 말하는 빅데이터급 저장용량단위',
        cat:['데이터','데이터표현','데이터표현단위'],
    },
    {
        mainkey :'EB',
        sub:'흔히 말하는 빅데이터급 저장용량단위',
        cat:['데이터','데이터표현','데이터표현단위'],
    },
    {
        mainkey :'ZB',
        cat:['데이터','데이터표현','데이터표현단위'],
    },
    {
        mainkey :'YB',
        cat:['데이터','데이터표현','데이터표현단위'],
    },
    {
        mainkey :'지식',
        cat:['데이터','데이터개념','지식'],
    },
    {
        mainkey :'암묵지',
        sub:'몸에 배어있지만 겉으로 드러나지않은 무형의지식',
        cat:['데이터','데이터개념','지식','형태'],
    },
    {
        mainkey :'형식지',
        sub:'언어,문자,기호로 표현되어 겉으로 드러난 유형의지식',
        cat:['데이터','데이터개념','지식','형태'],
    },
    {
        mainkey :'변환방법',
        cat:['데이터','데이터개념','지식'],
    },
    {
        mainkey :'공통화',
        sub:'암묵->암묵',
        eg:'어깨너머로배우기',
        cat:['데이터','데이터개념','지식','변환방법','SECI'],
    },
    {
        mainkey :'표출화',
        sub:'암묵->형식',
        eg:'내 노하우 글로쓰기',
        cat:['데이터','데이터개념','지식','변환방법','SECI'],
    },
    {
        mainkey :'연결화',
        sub:'형식->형식',
        eg:'여러문서를 엮어서 새 자료 만들기',
        cat:['데이터','데이터개념','지식','변환방법','SECI'],
    },
    {
        mainkey :'내면화',
        sub:'형식->암묵',
        eg:'매뉴얼을 익혀 몸에 배게하기',
        cat:['데이터','데이터개념','지식','변환방법','SECI'],
    },
    {
        mainkey :'나선구조',
        sub:'SECI 4단계 반복',
        eg:'개인의 지식에서 조직전체의 자산으로 축적',
        cat:['데이터','데이터개념','지식','변환방법'],
    },
    {
        mainkey :'특성',
        sub:'실계동내',
        eg:'데이터를 체계적으로 저장해주고 필요할때 꺼내쓰거나 수정할수있게 만든 저장/관리체계',
        cat:['데이터','데이터베이스'],
    },
    {
        mainkey :'실시간 접근성',
        sub:'이용자 질의에 즉시처리응답',
        cat:['데이터','데이터베이스','특성'],
    },
    {
        mainkey :'계속적 변화',
        sub:'삽입,삭제,갱신을 통해 내용이 계속바뀜',
        cat:['데이터','데이터베이스','특성'],
    },
    {
        mainkey :'동시 공용',
        sub:'사용자가 서로 다른목적으로 같은데이터 동시이용',
        cat:['데이터','데이터베이스','특성'],
    },
    {
        mainkey :'내용에 의한 참조',
        sub:'데이터의 내용(값)에 의한 참조',
        cat:['데이터','데이터베이스','특성'],
    },
    {
        mainkey :'데이터 독립성',
        cat:['데이터','데이터베이스'],
    },
    {
        mainkey :'논리적',
        eg:'테이블 구조(논리구조)가 바뀌어도 사용자 화면이나 프로그램엔 영향이적음',
        cat:['데이터','데이터베이스','데이터 독립성'],
    },
    {
        mainkey :'물리적',
        eg:'물리적 저장구조 및 방식이 바뀌어도 응용프로그램이 영향을 받지않는 성질',
        cat:['데이터','데이터베이스','데이터 독립성'],
    },
    {
        mainkey :'데이터 저장소',
        cat:['데이터','데이터베이스'],
    },
    {
        mainkey :'데이터 설계',
        cat:['데이터','데이터베이스'],
    },
    {
        mainkey :'정규화',
        cat:['데이터','데이터베이스','설계'],
    },
    {
        mainkey :'목적',
        cat:['데이터','데이터베이스','설계','정규화'],
    },
    {
        mainkey :'중복 제거',
        cat:['데이터','데이터베이스','설계','정규화','목적'],
    },
    {
        mainkey :'이상현상 제거',
        cat:['데이터','데이터베이스','설계','정규화','목적'],
    },
    {
        mainkey :'무결성 향상',
        cat:['데이터','데이터베이스','설계','정규화','목적'],
    },
    {
        mainkey :'테이블 분리',
        cat:['데이터','데이터베이스','설계','정규화','결과'],
    },
    {
        mainkey :'JOIN 증가',
        cat:['데이터','데이터베이스','설계','정규화','결과'],
    },
    {
        mainkey :'반정규화',
        cat:['데이터','데이터베이스','설계'],
    },
    {
        mainkey :'목적',
        cat:['데이터','데이터베이스','설계','반정규화'],
    },
    {
        mainkey :'겨',
        cat:['데이터','데이터베이스','설계','반정규화'],
    },
    {
        mainkey :'데이터 웨어하우스(DW)',
        sub:'비휘발성, 주제중심 통합보관 대규모 저장소',
        eg:'데이터 웨어하우스 > 데이터마트',
        cat:['데이터','데이터베이스','데이터저장소'],
    },
    {
        mainkey :'데이터 마트(DM)',
        sub:'특정 부서,주제를 위한 필요한 데이터만 모아 구성한 소규모 데이터저장소',
        eg:'데이터 웨어하우스 > 데이터마트',
        cat:['데이터','데이터베이스','데이터저장소'],
    },
    {
        mainkey :'데이터 처리',
        cat:['데이터','데이터베이스'],
    },
    {
        mainkey :'과정',
        cat:['데이터','데이터베이스','데이터처리'],
    },
    {
        mainkey :'1. Extract',
        sub:'필요 데이터 추출',
        cat:['데이터','데이터베이스','데이터처리','과정'],
    },
    {
        mainkey :'2. Transform',
        sub:'날짜형식통일, 중복제거, 필요한 값계산',
        cat:['데이터','데이터베이스','데이터처리','과정'],
    },
    {
        mainkey :'3. Load',
        sub:'데이터저장소에 저장(DW,DM)',
        cat:['데이터','데이터베이스','데이터처리','과정'],
    },
    {
        mainkey :'데이터 처리방식',
        cat:['데이터','데이터베이스'],
    },
    {
        mainkey :'OLAP',
        sub:'다차원 분석방법. 많은 데이터를 다양한 관점에서 조회',
        cat:['데이터','데이터베이스','데이터처리','방식'],
    },
    {
        mainkey :'드릴다운',
        sub:'상위 수준의 데이터를 더 세부적 수준으로 내려가면서 분석',
        cat:['데이터','데이터베이스','데이터처리','방식','OLAP'],
    },
    {
        mainkey :'롤업',
        sub:'세부데이터를 상위 수준으로 집계하여 분석',
        cat:['데이터','데이터베이스','데이터처리','방식','OLAP'],
    },
    {
        mainkey :'슬라이싱',
        sub:'다차원 데이터에서 특정 차원을 선택하여분석',
        cat:['데이터','데이터베이스','데이터처리','방식','OLAP'],
    },
    {
        mainkey :'OLTP',
        sub:'온라인 트랜젝션 처리, 여러사용자의 업무를 빠르게 처리하는 시스템',
        eg:'주문,결제,회원정보수정등 빠른 정보입력/수정/조회',
        cat:['데이터','데이터베이스','데이터처리','방식'],
    },
    {
        mainkey :'데이터활용',
        cat:['데이터'],
    },
    {
        mainkey :'경영',
        cat:['데이터','데이터활용'],
    },
    {
        mainkey :'SCM',
        sub:'공급망 전체 물류와 정보흐름을 최적화하여 재고와 비용을 줄임',
        eg:'원재료조달->생산->물류->최종소비전달과정을 최적화',
        cat:['데이터','데이터활용','경영정보시스템'],
    },
    {
        mainkey :'CRM',
        sub:'고객데이터 분석을 통한 고객 유지 및 재구매 상승',
        eg:'고객의 구매이력, 상담내역 수집 및 분석',
        cat:['데이터','데이터활용','경영정보시스템'],
    },
    {
        mainkey :'ERP',
        sub:'회계/인사/생산 등 기업내부 전체 자원을 하나로 묶는 시스템',
        cat:['데이터','데이터활용','경영정보시스템'],
    },
    {
        mainkey :'빅데이터',
        cat:['데이터'],
    },
    {
        mainkey :'변화',
        cat:['데이터','빅데이터'],
    },
    {
        mainkey :'사전처리->사후처리',
        sub:'일단 모으고 필요할때 처리한다',
        cat:['데이터','빅데이터','변화'],
    },
    {
        mainkey :'표본조사->전수조사',
        sub:'가능한 많은 전체 데이터를 분석하는 방향',
        cat:['데이터','빅데이터','변화'],
    },
    {
        mainkey :'질->양',
        sub:'많은데이터를 분석하는 양적분석 중요성 상승',
        cat:['데이터','빅데이터','변화'],
    },
    {
        mainkey :'인과관계->상관관계',
        sub:'데이터 사이에함께 나타나는관계를 찾아냄',
        cat:['데이터','빅데이터','변화'],
    },
    {
        mainkey :'특성',
        cat:['데이터','빅데이터'],
    },
    {
        mainkey :'3V',
        cat:['데이터','빅데이터','특성'],
    },
    {
        mainkey :'가치산정의 어려움',
        cat:['데이터','빅데이터','특성'],
        sub:'데이터 재사용,재조합,다목적활용으로 인한미래가치 측정의 어려움'
    },
    {
        mainkey :'Volume',
        sub:'규모',
        cat:['데이터','빅데이터','특성','3V'],
    },
    {
        mainkey :'Variety',
        sub:'다양성',
        cat:['데이터','빅데이터','특성','3V'],
    },
    {
        mainkey :'Velocity',
        sub:'속도',
        cat:['데이터','빅데이터','특성','3V'],
    },
    {
        mainkey :'4V',
        cat:['데이터','빅데이터','특성'],
    },
    {
        mainkey :'Value',
        sub:'가치',
        cat:['데이터','빅데이터','특성','4V'],
    },
    {
        mainkey :'5V',
        cat:['데이터','빅데이터','특성'],
    },
    {
        mainkey :'Veracity',
        sub:'신뢰성',   
        cat:['데이터','빅데이터','특성','5V'],
    },
    {
        mainkey :'기술/처리',
        cat:['데이터','빅데이터'],
    },
    {
        mainkey :'MapReduce',
        sub:'대용량 데이터 분산 병렬처리 프로그래밍모델',
        eg:'저렴한 범용 서버여러대를 병렬로 처리 , 데이터 여러노드 분산저장시 보안관리 부담이 커짐',
        cat:['데이터','빅데이터','기술/처리'],
    },
    {
        mainkey :'Map',
        sub:'거대 데이터를 여러 조각으로 쪼개 서버에 나누고 키:값 형태의 중간결과 만듦 ',
        cat:['데이터','빅데이터','기술/처리','MapReduce'],
    },
    {
        mainkey :'Reduce',
        sub:'같은 키끼리 모아 최종결과로 합침',
        eg:'RDBMS로 감당이 어려운 비정형/반정형 대용량 데이터 처리를위해 등장',
        cat:['데이터','빅데이터','기술/처리','MapReduce'],
    },
    {
        mainkey :'분석',
        cat:['데이터','빅데이터'],
    },
    {
        mainkey :'통계분석',
        cat:['데이터','빅데이터','분석'],
    },
    {
        mainkey :'데이터 마이닝',
        cat:['데이터','빅데이터','분석'],
    },
    {
        mainkey :'분류',
        cat:['데이터','빅데이터','분석','데이터 마이닝'],
    },
    {
        mainkey :'군집분석',
        sub:'비슷한 것 끼리 묶어서분석',
        eg:'구매패턴이 비슷한 고객들을 몇개의 집단으로나누어 마케팅 전략 수립',
        cat:['데이터','빅데이터','분석','데이터 마이닝'],
    },
    {
        mainkey :'거리',
        cat:['데이터','빅데이터','분석','데이터 마이닝','군집분석'],
    },
    {
        mainkey :'유클리드거리',
        sub:'두 점사이의 직선거리',
        eg: '√Σ(xi-yi)² : 좌표사이의 거리',
        cat:['데이터','빅데이터','분석','데이터 마이닝','군집분석','거리'],
    },
    {
        mainkey :'맨하탄거리',
        sub:'각 좌표 차이의 절댓값을 합한거리',
        eg:'Σ|xi-yi|',
        cat:['데이터','빅데이터','분석','데이터 마이닝','군집분석','거리'],
    },
    {
        mainkey :'마할라노비스거리',
        sub:'변수 간 상관관계의 분산을 고려한거리',
        eg:'D = √((x-μ)ᵀ S⁻¹ (x-μ)) : 데이터의 분산+변수의 상관관계 고려',
        cat:['데이터','빅데이터','분석','데이터 마이닝','군집분석','거리'],
    },
    {
        mainkey :'연관분석',
        sub:'같이 발생하는 패턴 찾기',
        eg:'A가 발생할때 B도 발생하는경향이 있는가?',
        cat:['데이터','빅데이터','분석','데이터 마이닝'],
    },
    {
        mainkey :'장바구니분석',
        sub:'연관분석을 상품 구매데이터에 적용한것',
        eg:'상품 구매데이터에서 연관관계를 찾는 대표적 활용사례',
        cat:['데이터','빅데이터','분석','데이터 마이닝','연관분석'],
    },
    {
        mainkey :'회귀분석',
        sub:'독립변수/종속변수 관계 수식을 모형화하여 연속형 값 예측',
        eg:'광고비,지출액, 매장면적 등 변수 참조 다음분기의 매출액예측',
        cat:['데이터','빅데이터','분석','데이터 마이닝'],
    },
    {
        mainkey :'소셜네트워크분석',
        sub:'개체를 노드,관계를 링크로보고 연결구조를 분석하는기법',
        eg:'연결,매개,접근 중심성으로 영향력있는 노드를 찾는다.',
        cat:['데이터','빅데이터','분석','데이터 마이닝'],
    },
    
    {
        mainkey :'인력',
        cat:['데이터','빅데이터',],
    },
    {
        mainkey :'데이터 사이언티스트',
        sub:'데이터 분석, 인사이트도출, 비즈니스 가치창출 전문가',
        cat:['데이터','빅데이터','인력'],
    },
    {
        mainkey :'역량',
        cat:['데이터','빅데이터','인력','데이터 사이언티스트'],
    },
    {
        mainkey :'하드스킬',
        sub:'통계,머신러닝,프로그래밍, 분석도구활용',
        cat:['데이터','빅데이터','인력','데이터 사이언티스트','역량'],
    },
    {
        mainkey :'소프트스킬',
        sub:'통찰력, 협업능력, 의사소통능력, 창의력, 호기심',
        cat:['데이터','빅데이터','인력','데이터 사이언티스트','역량'],
    },
    {
        mainkey :'알고리즈미스트',
        sub:'알고리즘 부작용과 피해를 파악하고 통제하는 전문가',
        eg:'빅데이터와 ai의 윤리적문제 완화 : 빅데이터 오남용을 막는 통제방안',
        cat:['데이터','빅데이터','인력'],
    },
    
    {
        mainkey :'데이터분석/기획',
        cat:['데이터 분석/기획'],
    },
    
    {
        mainkey :'분석 거버넌스',
        sub:'기업이 분석업무를 지속,체계적으로 관리하기 위한 틀',
        cat:['데이터 분석/기획'],
    },
    {
        mainkey :'구성요소',
        sub:'죠프시데교',
        cat:['데이터 분석/기획','분석 거버넌스'],
    },
    {
        mainkey :'조직',
        sub:'분석 업무 관리/수행할 전담인력과 조직',
        cat:['데이터 분석/기획','분석 거버넌스','구성요소'],
    },
    {
        mainkey :'프로세스',
        sub:'과제발굴~수행 및 결과공유까지 절차',
        cat:['데이터 분석/기획','분석 거버넌스','구성요소'],
    },
    {
        mainkey :'시스템',
        sub:'분석인프라와 IT도구',
        cat:['데이터 분석/기획','분석 거버넌스','구성요소'],
    },
    {
        mainkey :'데이터',
        sub:'분석 데이터 관리 체계',
        cat:['데이터 분석/기획','분석 거버넌스','구성요소'],
    },
    
]